kalman-folding-03-008-derivations.org
** Notation

The word /vector/ alone means /column vector/ by default. If a quantity is a row
vector, we explicitly say so. In general, lower-case boldface symbols like
$\mathbold{x}$ denote column vectors. Row vectors include a superscript
/transpose/ symbol, as in $\mathbold{a}^\intercal$. We write literal vectors in
square brackets, as in $\left[a, b, \ldots\right]^\intercal$ for a column vector
or $\left[a, b, \ldots\right]$ for a row vector or for cases where we don't care
whether it's a column or row.


Upper-case
boldface symbols like $\mathbold{M}$ denote matrices. Our matrices are not
always square. Because vectors are
special cases of matrices, some matrices are also vectors. We may use an
upper-case symbol to denote a vector, but we do not use a lower-case symbol to
denote a non-vector matrix.

Juxtaposition, as in
$\mathbold{A}\,\mathbold{x}$ or $\mathbold{A}\,\mathbold{B}$, means matrix
multiplication. 
When we write a product like
$\mathbold{A}\,\mathbold{B}$, we assume that the number of columns of
$\mathbold{A}$ matches the number of rows of $\mathbold{B}$. 

Matrix multiplication is non-commutative, meaning that
$\mathbold{A}\,\mathbold{B}$ does not, in general, equal
$\mathbold{B}\,\mathbold{A}$. However, if a matrix $\mathbold{D}$ is square and
diagonal,
meaning that it has non-zero entries only along its main diagonal from upper
left to lower right, then $\mathbold{A}\,\mathbold{D}$ does always equal
$\mathbold{D}\,\mathbold{A}$. We may freely use this fact without mentioning it
explicitly.

Symmetric matrices do not always
commute, even with other symmetric matrices. In particular, the product of two
symmetric matrices is not always symmetric, as witnessed by the following
counterexample:

#+BEGIN_LaTeX
\begin{equation*}
\left(
\begin{array}{cc}
 1 & 2 \\
 2 & 3 \\
\end{array}
\right)\cdot\left(
\begin{array}{cc}
 4 & 5 \\
 5 & 6 \\
\end{array}
\right)
=
\left(
\begin{array}{cc}
 14 & 17 \\
 23 & 28 \\
\end{array}
\right)
\end{equation*}
#+END_LaTeX


Matrix multiplication is associative, meaning that the order in which pairwise
multiplications is carried out does not matter. Thus 

\[(\mathbold{A}\,\mathbold{B})\,\mathbold{C}=\mathbold{A}\,(\mathbold{B}\,\mathbold{C})=\mathbold{A}\,\mathbold{B}\,\mathbold{C}\]

\noindent and we don't need to write parentheses. That means
some expressions of long products can be hard to read. We occasionally use
a center dot or $\times$ symbol to make multiplication easier to read, as in
$\mathbold{A}\cdot\mathbold{x}$ or $\mathbold{A}\times\mathbold{x}$. We also use
the $\times$ symbol when discussing the numbers of rows and columns of a matrix,
as in ``$\mathbold{A}$ is an $m\times n$ matrix,'' meaning that $\mathbold{A}$
has $m$ rows and $n$ columns.


We may freely  exploit the following facts without mentioning them explicitly:
- For any matrix $\mathbold{M}$, $\left(\mathbold{M}^\intercal\right)^\intercal = \mathbold{M}$
- For any invertible matrix $\mathbold{M}$, $\left(\mathbold{M}^{-1}\right)^{-1} = \mathbold{M}$
- For any two matrices $\mathbold{A}$ and
  $\mathbold{B}$,
  $\left(\mathbold{A}\,\mathbold{B}\right)^\intercal=\mathbold{B}^\intercal\mathbold{A}^\intercal$
- $\left(\mathbold{A}\,\mathbold{B}\right)^{-1}=\mathbold{B}^{-1}\mathbold{A}^{-1}$
  when the matrices are invertible
- $\mathbold{P}^\intercal$ = $\mathbold{P}$ if and only if $\mathbold{P}$ is
  symmetric

For any matrix $\mathbold{M}$, $\mathbold{M}^2$ means
$\mathbold{M}^\intercal\mathbold{M}$, the transpose of the matrix times the
matrix. Such squared matrices are always square and symmetric.
This notation pertains to vectors, as well, because they are just
special cases of matrices. Thus,
$\mathbold{x}^2=\mathbold{x}^\intercal\mathbold{x}$, the square of the Euclidean
$\mbox{2-\textrm{norm}}$ of $\mathbold{x}$, a scalar; and
$(\mathbold{x}^\intercal)^2 =
(\mathbold{x}^\intercal)^\intercal\cdot
\mathbold{x}^\intercal=
\mathbold{x}\,\mathbold{x}^\intercal$
is the outer product of $\mathbold{x}$ with itself; that outer product is an
$n\times{n}$ square, symmetric matrix, where $n$ is the dimensionality of $\mathbold{x}$. 



When $\mathbold{M}^2$ is invertible, $\mathbold{M}^{-2}$
means the inverse of $\mathbold{M}^2$, namely
$\left(\mathbold{M}^\intercal\mathbold{M}\right)^{-1}$.

We use the term /tall/ to mean a matrix with more rows than columns, that is, an
$m\times{n}$
matrix when
$m>n$. When discussing
$m\times{n}$
matrices, we  usually assume that
$m>n$.
We use the term /wide/ to mean a matrix with
more columns than rows, as in an $n\times{m}$ matrix. We use the term /small/ to
mean $n\times{n}$, and /large/ to mean $m\times{m}$. 

*** Probability and Statistics

We use the terms /distribution/ and /expectation value/ without definition in
this paper. If $\mathbold{x}$ is a random variable, then we denote the
expectation value of some function $f$ of $\mathbold{x}$ as $E[f(\mathbold{x})]$.

