kalman-folding-03-008-derivations.org
** Definitions

- $t$ :: is the independent variable. In many applications, $t$ represents physical
     time, or an integer index mapped to physical time. It is known and
     non-random. We treat it as a scalar, here, though it is possible to extend
     the theory to a vector $t$.

- $\mathbold{x}$ :: is the (column) vector of $n$ unknown, constant /states/
     of the model. It's a random variable, and we compute estimates and
     covariances /via/ expectation values over its distribution. This symbol
     also means an algebraic variable standing for some particular estimate of
     the states.

- $\mathbold{A}\,\mathbold{x}$ :: is the /model/; it predicts an observation at
     time $t$ given an estimate of the states $\mathbold{x}$ and a current
     partials matrix $\mathbold{A}$ that may depend on $t$. The model is a
     column vector of dimensionality $b\times{1}$, the same as the dimensionality of an
     observation $\mathbold{z}$.

- $\mathbold{A}$ :: is the /current partials matrix/, the partial derivative of
     the model with respect to the unknown states $\mathbold{x}$, evaluated
     at the current value of the independent variable $t$. We could write
     $\mathbold{A}$ as $\mathbold{A}(t)$; it's an
     aesthetic judgment to omit explicit $t$ dependence because it
     would make the derivations longer and harder to read.  Because the
     model is /linear/, the partials do not depend on $\mathbold{x}$. 
     $\mathbold{A}$ is known, non-random, and may depend on $t$. Generally,
     its dimensionality
     is $b\times{n}$, where $b$ is the dimensionality of an 
     observation $\mathbold{z}$.

- $\tilde{\mathbold{A}}$ :: is the /prior partials matrix/, a matrix that stacks
     all the prior rows of $\mathbold{A}$ that precede the current row. It is
     known, non-random, and $m b\times{n}$, where $m$ is the number of prior
     observations, $b$ is the dimensionality of a single
     observation $\mathbold{z}$, and $n$ is the dimensionality of the states
     $\mathbold{x}$.  Thus
     $\tilde{\mathbold{A}}$ is tall in the typical /overdetermined/ case where
     $m>n$, more observations than states. We do not actually
     realize $\tilde{\mathbold{A}}$ in computer memory because Kalman keeps
     /all information/ in the running covariance matrix. $\tilde{\mathbold{A}}$
     is just a
     useful abstraction for the derivations below.

- $\mathbold{z}$ :: is the /current observation/. It is known and non-random.
     Its dimensionality is $b\times{1}$.

- $\tilde{\mathbold{z}}$ :: is a stack of all prior observations. It
     is known, non-random, $m b\times{1}$. It's a useful abstraction in the
     derivations below. It's not necessary to actually realize it in computer
     memory because we use all its information incrementally by folding.

- ${\tilde{\mathbold{x}}}$ :: the /prior estimate/, the estimate of
     $\mathbold{x}$ given all information we have prior to the current
     observation. It is known, non-random, $n\times{1}$. 

- ${\hat{\mathbold{x}}}$ ::  the /posterior estimate/, the estimate of
     $\mathbold{x}$ given (1) the prior estimate ${\tilde{\mathbold{x}}}$, (2)
     the current partials $\mathbold{A}$, and (3) the current observation
     $\mathbold{z}$. It is known, non-random, $n\times{1}$. It satisfies
     /the Kalman update equation/:

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:kalman-update-equation}
{\hat{\mathbold{x}}} =
{\tilde{\mathbold{x}}} +
\mathbold{K}
\left(
\mathbold{z}-
\mathbold{A}\,
{\tilde{\mathbold{x}}}
\right)
\end{equation}
#+END_LaTeX

\noindent which is equivalent to  the recurrence
$\mathbold{x}\leftarrow\mathbold{x}+\mathbold{K}\,(z-\mathbold{A}\,\mathbold{x})$
used in part 1 of this series.

- ${\tilde{\mathbold{P}}}$ :: /covariance of the priors/, equals
     ${\tilde{\mathbold{A}}}^{-2}$
     (de-dimensionalized; proof sketch
     below). This is called just $\mathbold{P}$ in part one of this series.
     It is known, non-random, $n\times{n}$. 

- ${\hat{\mathbold{P}}}$ :: /posterior covariance/, satisfies
     ${\hat{\mathbold{P}}}\,
     {\mathbold{A}}^\intercal=
     \mathbold{K}=
     {\tilde{\mathbold{P}}}\,\mathbold{A}^\intercal\,\mathbold{D}^{-1}$
     (de-dimensionalized; proof sketch below). We calculate it from the prior covariance
     $\tilde{\mathbold{P}}$ and the new
     partials matrix $\mathbold{A}$. 
     It is known, non-random, $n\times{n}$. 

- $\mathbold{A}\,{\tilde{\mathbold{x}}}$ :: the /predicted observation/ given
     the prior estimate ${\tilde{\mathbold{x}}}$ and the current partials matrix
     $\mathbold{A}$. It is a particular evaluation of the model. It is known,
     non-random, $b\times{1}$.

- $\mathbold{z}-\mathbold{A}\,{\tilde{\mathbold{x}}}$ ::  the measurement
     /residual/, the difference between the current observation $\mathbold{z}$ and the
     predicted observation $\mathbold{A}\,{\tilde{\mathbold{x}}}$.

- $\mathbold{\zeta}$ ::  /observation noise/: random column-vector with
     zero mean and covariance $\mathbold{Z}$ (unity, $\mathbold{1}$, after
     de-dimensionalization).
     It has $b$ rows and $1$ column, like $\mathbold{z}$. 

- $\mathbold{Z}$ :: covariance of the observation noise, $E
     \left[
     \mathbold{\zeta}\,
     \mathbold{\zeta}^\intercal
     \right]$: known, non-random $b\times{b}$.

- $\tilde{\mathbold{z}} = \tilde{\mathbold{A}}\,{\mathbold{x}} + \mathbold{\zeta}$ :: the
     /observation equation/, which equates $\tilde{\mathbold{z}}$, the stack of
     all prior observations, to the product of $\tilde{\mathbold{A}}$, the stack
     of all prior partials matrices, and an unknown random vector of states,
     $\mathbold{x}$, plus some unknown random observation noise
     $\mathbold{\zeta}$.  The stack of prior observations
     $\tilde{\mathbold{z}}$ is known, non-random, $m b\times{1}$; the stack of prior
     partials matrices
     $\tilde{\mathbold{A}}$ is known, non-random, $m b\times{n}$; the state vector ${\mathbold{x}}$
     is unknown, random, $n\times{1}$; The noise vector $\mathbold{\zeta}$ is unknown, random,
     $m b\times{1}$. The observation equation looks similar to the expression for the residual
     above. It's worthwhile to take a little time to examine the notations carefully and make sure
     that you have a good mental picture of the meanings of these notations. The
     observation equation looks tall in the typical, overdetermined case, where
     as the residual is usually equivalent to a scalar expression.

- $\mathbold{K}$ :: /Kalman gain/
     $=
     {\tilde{\mathbold{P}}}\,
     \mathbold{A}^\intercal\,
     {\mathbold{D}}^{-1}$ (proof
     sketch below).
     Non-random, $n\times{b}$.

- $\mathbold{D}$ :: /Kalman denominator/
     $=
     \mathbold{Z}+
     \mathbold{A}\,
     {\tilde{\mathbold{P}}}\,
     \mathbold{A}^\intercal$,
     or 
     $\mathbold{1}+
     \mathbold{A}\,
     {\tilde{\mathbold{P}}}\,
     \mathbold{A}^\intercal$
     de-dimensionalized.
     (proof sketch below). Non-random, \(b\times{b}\).

