kalman-folding-03-008-derivations.org
** Demonstration that Prior Covariance ${\tilde{\mathbold{P}}} = \tilde{\mathbold{A}}^{-2}$

The fact that the prior covariance, $\tilde{\mathbold{P}}$, equals the
the inverse square of
the stack of prior partials matrices (de-dimensionalized), $\tilde{\mathbold{A}}^{-2}$, is the secret
to Kalman's efficient, in fact constant, use of computer memory. The stack of
prior partials matrices $\tilde{\mathbold{A}}$ can be very tall and impractical
to store. But its square, $\tilde{\mathbold{A}}^{2}$ is only $n\times{n}$, and
its inverse square is also just $n\times{n}$. Kalman packs all statistical
information about the model into this small matrix of constant size, and
incrementally improves the statistics as observations accumulate, without
increasing the size of the matrix, and thus without increasing the amount of
computer memory needed to keep all important information. The Kalman filter is
/optimal/, meaning that the small covariance matrices keep all available
information. No other method would be able to squeeze more information out of
the observations and the model --- at least when the noise is Gaussian. A
rigorous optimality proof is out of scope for this paper, but the least-squares
derivation below contains the central idea: Kalman tracks the estimate and
covariance that minimize the sum of squared residuals. Kalman is optimal in the
sense that no other method would find a smaller sum of squared residuals.


*** Covariance of Any Random Vector Variable

The covariance of any random column vector $\mathbold{y}$ is defined as the
expectation value
$E
\left[
\mathbold{y}\,
\mathbold{y}^\intercal
\right]
=
E
\left[
({\mathbold{y}^\intercal})^2
\right]$
\noindent This is the expectation value of an outer product of a column vector
$\mathbold{y}$ and its transpose, $\mathbold{y}^\intercal$. Therefore, it is a
$q\times{q}$ matrix, where $q\times{1}$ is the dimensionality of $\mathbold{y}$.

*** Prior Estimate ${\tilde{\mathbold{x}}}$

One of our random variables is $\mathbold{x}$, the column \mbox{$n$-vector} of unknown
states. To calculate its estimate, assume we know the values of all $m$ past
partials ${\tilde{\mathbold{A}}}$ (tall, $m b\times{n}$) and observations
$\tilde{\mathbold{z}}$ (tall, $m b\times{1}$).

Relate $\mathbold{x}$ to the known observations ${\tilde{\mathbold{z}}}$ and the known
partials ${\tilde{\mathbold{A}}}$ through the normally distributed random noise column
vector $\mathbold{\zeta}$ and the /observation equation/:

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:observation-equation}
{\tilde{\mathbold{z}}}={\tilde{\mathbold{A}}}\,\mathbold{x}+\mathbold{\zeta}
\end{equation}
#+END_LaTeX

