kalman-folding-03-008-derivations.org
*** Sum of Squared Residuals

Consider the
following /performance functional/, computed over the population of
$\mathbold{x}$.

#+BEGIN_LaTeX
\begin{equation*}
J(\mathbold{x})
\stackrel{\text{\tiny def}}{=}
\zeta^2=
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)^2=
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)^\intercal
\cdot
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)
\end{equation*}
#+END_LaTeX

\noindent $J(\mathbold{x})$ is a scalar: the sum of squared residuals. A
/residual/ is a difference between an actual observation $\mathbold{z}$ and a
predicted observation $\mathbold{A}\,\mathbold{x}$. An /actual observation/
$\mathbold{z}$ is a known,
concrete \mbox{$b$-vector} of numbers, and the partials matrix $\mathbold{A}$
is a known, concrete \mbox{$(b\times n)$-matrix} of numbers
corresponding to that observation. The observation equation

- stacks all prior observations (known, concrete numbers) into
  $\tilde{\mathbold{z}}$
- stacks all prior 
  values of the partials matrix $\mathbold{A}$ into $\tilde{\mathbold{A}}$ (known,
  concrete numbers)
- multiplies by the unknown random state estimate
  $\mathbold{x}$ to get the (unknown, random)
  predicted observations ${\tilde{\mathbold{A}}}\,\mathbold{x}$
- finally adds some
  unknown random noise $\mathbold{\zeta}$ (column vector of height $m b$)

The performance functional collapses all that
information into a scalar random variable $J(\mathbold{x})$ with the same (Gaussian) distribution
as the noise $\mathbold{\zeta}$. Recall that any /random variable/ is, in fact,
always a
function, even if only the identity function, as when we say that $\mathbold{x}$
is a random variable. This is the standard nomenclature of probability and
statistics established by Kolmogorov, and it admittedly can be confusing.

The job of finding the optimal estimate of the state vector $\mathbold{x}$ is
the job of finding the concrete, numerical value of $\mathbold{x}$ that minimizes the
performance functional $J(\mathbold{x})$, which depends on all the known,
non-random, concrete numbers in $\tilde{\mathbold{z}}$ and $\tilde{\mathbold{A}}$.

To
find the $\mathbold{x}$ that minimizes $J(\mathbold{x})$, we could take the
classic, school approach of setting to zero the partial derivatives of
$J(\mathbold{x})$ with respect to $\mathbold{x}$ and solving the resulting
equations for $\mathbold{x}$. The following is an easier way. Multiply the
residuals across by the wide matrix ${\tilde{\mathbold{A}}}^\intercal$:

#+BEGIN_LaTeX
\begin{equation*}
{\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{z}}} - 
{\tilde{\mathbold{A}}}^2\,
\mathbold{x}
\end{equation*}
#+END_LaTeX

\noindent producing an \mbox{$n$-vector}, and then construct a
modified performance functional:

#+BEGIN_LaTeX
\begin{equation*}
J'(\mathbold{x})
\stackrel{\text{\tiny def}}{=}
\left(
{\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{z}}} -
{\tilde{\mathbold{A}}}^2\,
\mathbold{x}
\right)^2
=
\left(
{\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{z}}} -
{\tilde{\mathbold{A}}}^2\,
\mathbold{x}
\right)^\intercal
\cdot
\left(
{\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{z}}} -
{\tilde{\mathbold{A}}}^2\,
\mathbold{x}\right)
\end{equation*}
#+END_LaTeX

\noindent $J(\mathbold{x})$ is minimum with respect to $\mathbold{x}$ if and
only if (iff) $J'(\mathbold{x})$ is minimum (this assertion needs a rigorous
proof; as warned, we present only sketches in this paper). Because
$J'(\mathbold{x})$ is non-negative, when $J'(\mathbold{x})$ /can/ be zero, its
minimum /must/ be zero. $J'(\mathbold{x})$ is zero iff
${\tilde{\mathbold{A}}}^2$, an $n\times{n}$ square matrix, is invertible
(non-singular), in which case

#+BEGIN_LaTeX
\begin{equation*}
\mathbold{x}=
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{z}}}
\end{equation*}
#+END_LaTeX

\noindent produces that minimum value of $J'(\mathbold{x})$, because then

#+BEGIN_LaTeX
\begin{equation*}
{\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{z}}}=
{\tilde{\mathbold{A}}}^2\,
\mathbold{x}
\end{equation*}
#+END_LaTeX

We call such a solution for $\mathbold{x}$ the /least-squares estimate/ of
$\mathbold{x}$: the estimate of
$\mathbold{x}$ based on all prior observations.
From now on, we write it as ${\tilde{\mathbold{x}}}$

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:least-squares-estimate}
\tilde{\mathbold{x}}
\stackrel{\text{\tiny def}}{=}
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal
{\tilde{\mathbold{z}}} 
\end{equation}
#+END_LaTeX

With this solution, we get a new expression for the performance functional
$J(\mathbold{x})$ that is  useful below. First note that 

#+BEGIN_LaTeX
\begin{alignat}{6}
\notag
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{A}}}^{-2}
&=
\mathbold{1}
&& \text{}
\\
\notag
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal
&=
{\tilde{\mathbold{A}}}^\intercal
&& 
\quad\text{Multiply on right by }\tilde{\mathbold{A}}^\intercal
\\
\notag
({\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{A}}})\,
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal
&=
{\tilde{\mathbold{A}}}^\intercal
&&
\quad\text{Expand definition of }{\tilde{\mathbold{A}}}^2
\\
\label{eqn:aa2at-is-one}
\mathrm{therefore}\quad
{\tilde{\mathbold{A}}}\,
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal
&=
\mathbold{1}
&&
\quad\text{Arbitrariness of }\tilde{\mathbold{A}}^\intercal\text{on left}
\end{alignat}
#+END_LaTeX



\noindent Equation \ref{eqn:aa2at-is-one} is another assertion that requires a
rigorous proof, out of scope for this paper of sketches. But, assuming it is
true, we have

#+BEGIN_LaTeX
\begin{alignat}{6}
\notag
J(\mathbold{x})
&=
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)^\intercal
\cdot
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)
\\
\notag
&=
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)^\intercal
{\tilde{\mathbold{A}}}\,
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)
&&
\quad\text{insert }\mathbold{1}\text{ from equation \ref{eqn:aa2at-is-one}}
\\
\notag
&=
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)^\intercal
{\tilde{\mathbold{A}}}\,
({\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^2)\,
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)
&&
\quad\text{insert }\mathbold{1} = {\tilde{\mathbold{A}}}^{-2}\,{\tilde{\mathbold{A}}}^{2}
\\
\notag
&=
\left[
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)^\intercal
{\tilde{\mathbold{A}}}\,
{\tilde{\mathbold{A}}}^{-2}
\right]
{\tilde{\mathbold{A}}}^2
\left[
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)
\right]
&&
\quad\text{Regroup}
\\
\notag
&=
\left[
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)
\right]^\intercal
{\tilde{\mathbold{A}}}^2
\left[
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal
\left(
{\tilde{\mathbold{z}}}-
{\tilde{\mathbold{A}}}\,
\mathbold{x}
\right)
\right]
&&
\quad\text{Symmetry of $\tilde{\mathbold{A}}$ and $\tilde{\mathbold{A}}^{-2}$}
\\
\label{eqn:performance-functional-reformed}
&=
(\tilde{\mathbold{x}}-\mathbold{x})^\intercal\,
{\tilde{\mathbold{A}}^2}\,
(\tilde{\mathbold{x}}-\mathbold{x})
&&
\quad\text{Definition of }{\tilde{\mathbold{x}}}\text{ from equation \ref{eqn:least-squares-estimate}}
\end{alignat}
#+END_LaTeX

\noindent
This has
physical dimensions $\mathcal{Z}^2$ where $\mathcal{Z}$ are the physical
dimensions of the observations $\mathbold{z}$.

