kalman-folding-03-008-derivations.org
*** Prior Covariance $\tilde{\mathbold{P}}$

We now want the covariance of the residuals between
our least-squares estimate $\tilde{\mathbold{x}}$ and the random vector
$\mathbold{x}$:

#+BEGIN_LaTeX
\begin{align}
\label{eqn:covariance-of-x}
\tilde{\mathbold{P}}
\stackrel{\text{\tiny def}}{=}
E
\left[
(\tilde{\mathbold{x}}-\mathbold{x})
(\tilde{\mathbold{x}}-\mathbold{x})^\intercal
\right]
\end{align}
#+END_LaTeX

\noindent  Get $\tilde{\mathbold{x}}-\mathbold{x}$
from the observations and partials at hand as follows:

#+BEGIN_LaTeX
\begin{alignat}{6}
\notag
{\tilde{\mathbold{z}}}
&=
{\tilde{\mathbold{A}}}\,
\mathbold{x} + 
\mathbold{\zeta}
&&
\quad\text{the observation equation, Equation \ref{eqn:observation-equation}}
\\
\notag
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{z}}}
&=
\mathbold{x} + 
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal\,
\mathbold{\zeta}
&&
\quad\text{Multiply on left by }{\tilde{\mathbold{A}}}^{-2}\,\tilde{\mathbold{A}}^\intercal
\\
\notag
\tilde{\mathbold{x}}
&=
\mathbold{x} +
{\tilde{\mathbold{A}}}^{-2}\,
{\tilde{\mathbold{A}}}^\intercal\,
\mathbold{\zeta}
&&
\quad\text{Definition of }{\tilde{\mathbold{x}}}\text{ from equation \ref{eqn:least-squares-estimate}}
\\
\notag
\text{therefore}\quad
\tilde{\mathbold{x}} -
\mathbold{x} &=
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal
\mathbold{\zeta}
\end{alignat}
#+END_LaTeX

\noindent
Now rewrite equation \ref{eqn:covariance-of-x}, the definition of the prior
covariance $\tilde{\mathbold{P}}$:

#+BEGIN_LaTeX
\begin{align}
\notag
E
\left[
(\tilde{\mathbold{x}}-\mathbold{x})
(\tilde{\mathbold{x}}-\mathbold{x})^\intercal
\right] &=
E
\left[
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal
\mathbold{\zeta}\,
\mathbold{\zeta}^\intercal
({\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal
\mathbold{\zeta})^\intercal
\right] \\
\label{eqn:almost-final-covariance}
&=
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal\,
E\left[
\mathbold{\zeta}\,
\mathbold{\zeta}^\intercal
\right]
({\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal)^\intercal
\end{align}
#+END_LaTeX

\noindent We can collapse the expectation value inwards because the stack of
observation partials $\tilde{\mathbold{A}}$ is a matrix of concrete, non-random
numbers. 

Noise $\mathbold{\zeta}$ is Gaussian, normal, with diagonal covariance
matrix $\mathbold{Z}$, by hypothesis. Equation \ref{eqn:almost-final-covariance}
becomes

#+BEGIN_LaTeX
\begin{align} 
\notag
\tilde{\mathbold{P}} =
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal\,
E\left[
\mathbold{\zeta}\,\mathbold{\zeta}^\intercal
\right]
({\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal)^\intercal 
&= 
\notag
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal\,
\mathbold{Z}\,
({\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal)^\intercal 
\\
&= 
\notag
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal\,
\mathbold{Z}\,
{\tilde{\mathbold{A}}}
({\tilde{\mathbold{A}}}^{-2})^\intercal
\\
&= 
\label{eqn:prior-covariance-convenient-form}
{\tilde{\mathbold{A}}}^{-2}
{\tilde{\mathbold{A}}}^\intercal\,
\mathbold{Z}\,
{\tilde{\mathbold{A}}}
({\tilde{\mathbold{A}}}^{-2})
\end{align}
#+END_LaTeX

\noindent because $\tilde{\mathbold{A}}^{-2}$ is symmetric.
At this point, no further simplification is possible, in general, because
$\mathbold{Z}$ is $b\times b$ and can only be sandwiched between
${\tilde{\mathbold{A}}}^\intercal$, $n\times b$, and 
${\tilde{\mathbold{A}}}$, $b\times n$. However, we can greatly simplify this and
all subsequent computations by de-dimensionalizing. There are numerical
benefits, as well, to be discussed in the next section.

*** De-Dimensionalizing the Observation Equation

Fully spelled out, and in the general case of \mbox{$b$-vector} observations
$\mathbold{z}$, one block of height $b$ of the observation equation is

#+BEGIN_LaTeX
\begin{equation*}
\left(
\begin{array}{c}
 z_1 \\
 z_2 \\
 \vdots  \\
 z_b \\
\end{array}
\right)=\left(
\begin{array}{cccc}
 A_{11} & A_{12} & \cdots  & A_{1 n} \\
 A_{21} & A_{22} & \cdots  & A_{2 n} \\
 \vdots  & \vdots  & \ddots & \vdots  \\
 A_{\text{b1}} & A_{\text{b2}} & \cdots  & A_{b n} \\
\end{array}
\right) \left(
\begin{array}{c}
 x_1 \\
 x_2 \\
 \vdots  \\
 x_n \\
\end{array}
\right)+\left(
\begin{array}{c}
 \zeta _1 \\
 \zeta _2 \\
 \vdots  \\
 \zeta _b \\
\end{array}
\right)
\end{equation*}
#+END_LaTeX

If we divide each row $i$ by the standard deviation $\sigma_{z_i}$ of the \mbox{$i$-th}
component $z_i$ of the observation $\mathbold{z}$, we get

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:de-dimensionalized-observation-equation}
\left(
\begin{array}{c}
 \frac{z_1}{\sigma _{z_1}} \\
 \frac{z_2}{\sigma _{z_2}} \\
 \vdots  \\
 \frac{z_b}{\sigma _{z_b}} \\
\end{array}
\right)=\left(
\begin{array}{cccc}
 \frac{A_{11}}{\sigma _{z_1}} & \frac{A_{12}}{\sigma
   _{z_1}} & \cdots  & \frac{A_{1 n}}{\sigma _{z_1}} \\
 \frac{A_{21}}{\sigma _{z_2}} & \frac{A_{22}}{\sigma
   _{z_2}} & \cdots  & \frac{A_{2 n}}{\sigma _{z_2}} \\
 \vdots  & \vdots  & \ddots & \vdots  \\
 \frac{A_{\text{b1}}}{\sigma _{z_b}} &
   \frac{A_{\text{b2}}}{\sigma _{z_b}} & \cdots  &
   \frac{A_{b n}}{\sigma _{z_b}} \\
\end{array}
\right) \left(
\begin{array}{c}
 x_1 \\
 x_2 \\
 \vdots  \\
 x_n \\
\end{array}
\right)+\left(
\begin{array}{c}
 \frac{\zeta _1}{\sigma _{z_1}} \\
 \frac{\zeta _2}{\sigma _{z_2}} \\
 \vdots  \\
 \frac{\zeta _b}{\sigma _{z_b}} \\
\end{array}
\right)
\end{equation}
#+END_LaTeX

The covariance of the noise $\mathbold{\zeta}$, so normalized, is non-dimensional
unity and equation \ref{eqn:prior-covariance-convenient-form} collapses
completely to just

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:prior-covariance-most-convenient-form}
\tilde{\mathbold{P}}={\tilde{\mathbold{A}}}^{-2}
\end{equation}
#+END_LaTeX

\noindent and the estimate of the priors, equation
\ref{eqn:least-squares-estimate} now becomes

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:estimate-of-the-priors}
\tilde{\mathbold{x}}
\stackrel{\text{\tiny def}}{=}
\tilde{\mathbold{P}}\,
{\tilde{\mathbold{A}}}^\intercal
{\tilde{\mathbold{z}}} 
\end{equation}
#+END_LaTeX


This is remarkable. All information about the covariance of the noise is pulled
into the (new, normalized) observation partials. 

I remember, when working in the early 1980's at the Deep Space Network at JPL on
direct measurement of tectonic drift,[fn:jplg] one difficulty was the wide
disparity between uncertainties of horizontal measurments (right ascension and
declination) and uncertainties in range. For instance, we knew the RA-dec
position of the centroid of Saturn within 75 meters but its distance to no
better than a million kilometers. That's a disparity of seven orders of
magnitude (the situation is greatly improved, now, due to the accumulation of
range data for multiple spacecraft coupled with decades of orbital
mechanics[fn:folk]). At the time, this meant that we had to deal with error
ellipsoids that were long, thin needles, covariance matrices with components
differing by up to fourteen orders of magnitude. That's not practical with
floating-point computer arithmetic. One mitigation was de-dimensionalizing or
normalizing, as described here, which brings the uncertainties of all components
of an observation into the same numerical range, near unity. Another mitigation
was Square Root Information Filtering (SRIF), the subject of another paper in
this series.

In any event, for all subsequent calculations in this paper, we assume that the
observation equation has been normalized and that $\mathbold{Z}=\mathbold{1}$. 


