kalman-folding-03-008-derivations.org
** Posterior Estimate $\hat{\mathbold{x}}$ and Covariance $\hat{\mathbold{P}}$

To effect incremental updates of $\mathbold{x}$ and $\mathbold{P}$, we need the
posterior estimate $\hat{\mathbold{x}}$ and covariance $\hat{\mathbold{P}}$ in
terms of the priors $\tilde{\mathbold{x}}$, $\tilde{\mathbold{P}}$, and the new
partials $\mathbold{A}$ and new observation $\mathbold{z}$, all  of which are
matrices of known, concrete, non-random numbers. This is exactly what our
/kalmanStatic/ function from equation \ref{eqn:kalman-cume-definition} does, of course,
in functional form.  We derive the posteriors from scratch to seek
opportunities to define $\mathbold{K}$ and $\mathbold{D}$ and to radically shorten
the expressions. 

First, define a new performance functional $J_1(\mathbold{x})$ as the sum of the 
performance of the priors $\tilde{J}(\mathbold{x})$ from equation
\ref{eqn:performance-functional-reformed}, now written with tildes overhead,
and a new term
$J_2(\mathbold{x})$ for the
performance of the new data:

#+BEGIN_LaTeX
\begin{alignat}{6}
J_1(\mathbold{x})
& \stackrel{\text{\tiny def}}{=}
{\tilde{J}}(\mathbold{x}) +
J_2(\mathbold{x})
\\
\notag
{\tilde{J}}(\mathbold{x})
&\stackrel{\text{\tiny def}}{=}
(\tilde{\mathbold{x}}-\mathbold{x})^\intercal\,
{\tilde{\mathbold{A}}^2}\,
(\tilde{\mathbold{x}}-\mathbold{x})
&&
\quad\text{Equation \ref{eqn:performance-functional-reformed}}
\\
\label{eqn:performance-of-new-data}
J_2(\mathbold{x})
&\stackrel{\text{\tiny def}}{=}
\left(
\mathbold{z}-
\mathbold{A}\,
\mathbold{x}
\right)^2
\\
\notag
&=
\left(
\mathbold{z}-
\mathbold{A}\,
\mathbold{x}
\right)^\intercal
\cdot
\left(
\mathbold{z}-
\mathbold{A}\,
\mathbold{x}
\right)
\\
\notag
&=
\mathbold{z}^2 -
\mathbold{z}^\intercal\,
\mathbold{A}\,
\mathbold{x} -
\mathbold{z}\,
\mathbold{x}^\intercal\,
\mathbold{A}^\intercal +
\left(
\mathbold{A}\,
\mathbold{x}
\right)^2
\\
\notag
&=
\mathbold{z}^2 -
2\,
\mathbold{z}^\intercal\,
\mathbold{A}\,
\mathbold{x} +
\left(
\mathbold{A}\,
\mathbold{x}
\right)^2
\end{alignat}
#+END_LaTeX

This time, I don't have a handy trick for minimizing the performance functional.
Let's find the minimizing $\mathbold{x}$ the classic way: by solving
$d\,J_1(\mathbold{x})/d\,\mathbold{x}=0$. The usual way to write a vector
derivative is with the /nabla/ operator $\nabla$, which produces /gradient/
vectors from scalar functions.

#+BEGIN_LaTeX
\begin{align*}
\nabla{}\,f(\mathbold{x}) &\stackrel{\text{\tiny def}}{=}
\begin{bmatrix}
df(\mathbold{x})/dx_0\\
df(\mathbold{x})/dx_1\\
\vdots\\
df(\mathbold{x})/dx_{n-1}
\end{bmatrix}
\end{align*}
#+END_LaTeX

The particular scalar function we're differentiating is, of course, the new
performance functional
$J_1(\mathbold{x})=
{\tilde{J}}(\mathbold{x})+
J_2(\mathbold{x})$. Because
${\tilde{\mathbold{A}}^2}$ is symmetric,

#+BEGIN_LaTeX
\begin{align*}
\nabla{}\,
{\tilde{J}}(\mathbold{x}) &=
\nabla{}
\left(
(\tilde{\mathbold{x}}-\mathbold{x})^\intercal\,
{\tilde{\mathbold{A}}^2}\,
(\tilde{\mathbold{x}}-\mathbold{x})
\right) \\ &=
-2\,
{\tilde{\mathbold{A}}^2}\,
(\tilde{\mathbold{x}}-\mathbold{x})
\end{align*}
#+END_LaTeX

\noindent an \mbox{$n$-vector}, and we similarly compute the gradient of
$J_2(\mathbold{x})$, which contains the new observation and partials:

#+BEGIN_LaTeX
\begin{align*}
\nabla\,
J_2(\mathbold{x})
&=
\nabla
\left(
\mathbold{z}^2 -
2\,
\mathbold{z}^\intercal\,
\mathbold{A}\,
\mathbold{x} +
\left(
\mathbold{A}\,
\mathbold{x}
\right)^2
\right)
\\
&=
2\,
\mathbold{A}^\intercal
\left(
\mathbold{A}\,
\mathbold{x} -
\mathbold{z}
\right)
\\
&=
2\,
\left(
\mathbold{A}^2\,
\mathbold{x}-
\mathbold{A}^\intercal\,
\mathbold{z}
\right)
\end{align*}
#+END_LaTeX

\noindent another \mbox{$n$-vector}. We can solve the resulting equation for
$\mathbold{x}$ on sight, writing the new solution --- the new estimate ---
with an overhat. Be aware that
that $\mathbold{A}$ is a wide matrix, in fact   an \mbox{$n$-row} when $b=1$, a
common case, and 
$\mathbold{A}^2$ is thus an outer product and an $n\times{n}$ matrix.


#+BEGIN_LaTeX
\begin{align}
\notag
\nabla{}\,
J_1(\mathbold{x}) 
&= 
\nabla{}\,
{\tilde{J}}
(\mathbold{x}) + 
\nabla{}\,
J_2(\mathbold{x}) 
= 0
\\
\notag
&=
{\tilde{\mathbold{A}}}^2\,
\mathbold{x} -
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{x}}} +
\mathbold{A}^2\,
\mathbold{x} - 
\mathbold{A}^\intercal{}\,
\mathbold{z}
\\
\label{eqn:def-of-posterior-estimate}
&
\text{if and only if}\quad
\mathbold{x}=\hat{\mathbold{x}}
\stackrel{\text{\tiny def}}{=}
\left(
{\tilde{\mathbold{A}}}^2 + 
\mathbold{A}^2
\right)^{-1}
\cdot
\left(
\mathbold{A}^\intercal\,
\mathbold{z} + 
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{x}}}
\right)
\end{align}
#+END_LaTeX

Look how pretty this is. Equation \ref{eqn:estimate-of-the-priors} for the
priors gave us the form
$\tilde{\mathbold{x}}= \tilde{\mathbold{P}}\,
\tilde{\mathbold{A}}^\intercal\,\tilde{\mathbold{z}}$, a covariance 
$\tilde{\mathbold{P}}$
times  the prior observations 
$\tilde{\mathbold{z}}$
scaled by the prior partials, transposed, 
$\tilde{\mathbold{A}}^\intercal$. 
The new estimate $\hat{\mathbold{x}}$ has exactly
the same form if we regard the first matrix factor
$\left({\tilde{\mathbold{A}}}^2 + \mathbold{A}^2 \right)^{-1}$ 
as a  covariance
$\hat{\mathbold{P}}$  and if
we regard /all/ the priors ${\tilde{\mathbold{A}}}^2\,{\tilde{\mathbold{x}}}$ as a /single/
scaled observation
to add to the current scaled observation $\mathbold{A}^\intercal\,\mathbold{z}$.
We may regard ${\tilde{\mathbold{A}}^2}\,\tilde{\mathbold{x}}$ as a scaled
observation because
equations
\ref{eqn:prior-covariance-most-convenient-form}
and
\ref{eqn:estimate-of-the-priors}
imply that
${\tilde{\mathbold{A}}^\intercal}\,\tilde{\mathbold{z}}={\tilde{\mathbold{A}}^2}\,\tilde{\mathbold{x}}$. 
We may view the second term above,
$\mathbold{A}^\intercal\,
\mathbold{z} + 
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{x}}}$, 
as
$\mathbold{A}^\intercal\,
\mathbold{z} + 
{\tilde{\mathbold{A}}}^\intercal\,
{\tilde{\mathbold{z}}}$.

