kalman-folding-03-008-derivations.org
*** Posterior estimate, $\hat{\mathbold{x}}$

We must wrangle 
equation
\ref{eqn:kalman-update-equation}
from
equation
\ref{eqn:def-of-posterior-estimate}.
Equation 
\ref{eqn:kalman-update-equation}
is the recurrence we want,
namely 
$\hat{\mathbold{x}}=\tilde{\mathbold{x}}+\mathbold{K}(\mathbold{z}-\mathbold{A}\,\tilde{\mathbold{x}})$,
and equation
\ref{eqn:def-of-posterior-estimate}
is the recurrence we have, namely\\
\(
\hat{\mathbold{x}}
=
\left(
{\tilde{\mathbold{A}}}^2 + 
\mathbold{A}^2
\right)^{-1}\,
\left(
\mathbold{A}^\intercal\,
\mathbold{z} + 
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{x}}}
\right)
\).

First, formally define the new, posterior covariance.

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:new-p-hat-definition}
{\hat{\mathbold{P}}}
\stackrel{\text{\tiny def}}{=}
\left(
{\tilde{\mathbold{A}}}^2 + \mathbold{A}^2
\right)^{-1}
\end{equation}
#+END_LaTeX

\noindent Now write 
equation
\ref{eqn:def-of-posterior-estimate}
as

#+BEGIN_LaTeX
\begin{align*}
\hat{\mathbold{x}}
&=
\hat{\mathbold{P}}\,
\left(
\mathbold{A}^\intercal\,
\mathbold{z} + 
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{x}}}
\right)
\\
\\
&=
\hat{\mathbold{P}}\,\mathbold{A}^\intercal\,
\mathbold{z}
+
\hat{\mathbold{P}}\,
\tilde{\mathbold{A}}^2\,\tilde{\mathbold{x}}
\\
\end{align*}
#+END_LaTeX


The form above strongly suggests that we define

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:kalman-gain-new-definition}
\mathbold{K}
\stackrel{\text{\tiny def}}{=}
{\hat{\mathbold{P}}}\,
\mathbold{A}^\intercal
\end{equation}
#+END_LaTeX

\noindent yielding

#+BEGIN_LaTeX
\begin{align}
\label{eqn:first-part-of-gain-proof}
\hat{\mathbold{x}}
&=
\mathbold{K}\,
\mathbold{z}
+
{\hat{\mathbold{P}}}\,
\tilde{\mathbold{A}}^2\,\tilde{\mathbold{x}}
\end{align}
#+END_LaTeX

\noindent Now, to get the recurrence we want

#+BEGIN_LaTeX
\begin{align}
\notag
\hat{\mathbold{x}}
&=
\tilde{\mathbold{x}}+
\mathbold{K}
\left(
\mathbold{z}-
\mathbold{A}\,
{\tilde{\mathbold{x}}}
\right)
\\
\label{eqn:second-part-of-gain-proof}
&=
\tilde{\mathbold{x}}+
\mathbold{K}\,
\mathbold{z}-
\mathbold{K}\,
\mathbold{A}\,
{\tilde{\mathbold{x}}}
\end{align}
#+END_LaTeX

\noindent we need only set equation \ref{eqn:first-part-of-gain-proof} equal to
equation \ref{eqn:second-part-of-gain-proof}.  Cancelling terms and rearranging,
we get

#+BEGIN_LaTeX
\begin{align}
\label{eqn:recurrence-to-prove}
(\mathbold{1}-\mathbold{K}\,\mathbold{A})\,
\tilde{\mathbold{x}}
&=
{\hat{\mathbold{P}}}\,
\tilde{\mathbold{A}}^2\,\tilde{\mathbold{x}} 
=
{\hat{\mathbold{P}}}\,
\tilde{\mathbold{P}}^{-1}\,\tilde{\mathbold{x}} 
\end{align}
#+END_LaTeX

\noindent by definition of the prior covariance, equation
\ref{eqn:prior-covariance-most-convenient-form}. For arbitrary
$\tilde{\mathbold{x}}$, this will be true if 

#+BEGIN_LaTeX
\begin{align*}
(\mathbold{1}-\mathbold{K}\,\mathbold{A})
&=
{\hat{\mathbold{P}}}\,
\tilde{\mathbold{P}}^{-1}
\end{align*}
#+END_LaTeX

\noindent Rearrange and right-multiply by $\tilde{\mathbold{P}}$ to get

#+BEGIN_LaTeX
\begin{align}
\label{eqn:p-is-l-p}
\hat{\mathbold{P}}
&=\left(
\mathbold{1}-
\mathbold{K}\,
\mathbold{A}
\right)\,
\tilde{\mathbold{P}}
=
\hat{\mathbold{P}}\,{\tilde{\mathbold{A}}}^2\,\tilde{\mathbold{P}}
\end{align}
#+END_LaTeX

\noindent showing that equations \ref{eqn:recurrence-to-prove} and
\ref{eqn:kalman-update-equation} are just alternative expressions for the same
thing.


Let's write this more compactly

#+BEGIN_LaTeX
\begin{align}
\label{eqn:derivation-of-p-is-l-p}
{\hat{\mathbold{P}}} &=
\mathbold{L}\,
{\tilde{\mathbold{P}}}
\end{align}
#+END_LaTeX

\noindent where

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:definition-of-l}
\mathbold{L}\stackrel{\text{\tiny def}}{=}
(\mathbold{1}-
\mathbold{K}\,
\mathbold{A})
=
\hat{\mathbold{P}}\,{\tilde{\mathbold{A}}}^2
\end{equation}
#+END_LaTeX

\noindent and we have
one of the three equivalent recurrences
for the posterior covariance
from the first paper in this series

#+BEGIN_LaTeX
\begin{equation}
{{\mathbold{P}}} \leftarrow
\mathbold{L}\,
{{\mathbold{P}}}
\end{equation}
#+END_LaTeX

*** A Gain Matrix $\mathbold{K}$ We Can Actually Compute



Of course, the gain matrix $\mathbold{K}$ is formally defined in terms of the
posterior covariance, that is, as $\hat{\mathbold{P}}\,\mathbold{A}^\intercal$,
but we don't have the posterior covariance $\hat{\mathbold{P}}$ by equation
\ref{eqn:p-is-l-p} until we have the gain matrix $\mathbold{K}$. To get out of
this fix, we note that 

#+BEGIN_LaTeX
\begin{equation*}
\mathbold{K}
=
\hat{\mathbold{P}}\,
\mathbold{A}^\intercal
=
\mathbold{L}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
=
(\mathbold{1}-
\mathbold{K}\,
\mathbold{A})\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
\end{equation*}
#+END_LaTeX

\noindent and solve for $\mathbold{K}$:

#+BEGIN_LaTeX
\begin{align}
\notag
\mathbold{K}
&=
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
-
\mathbold{K}\,
\mathbold{A}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
\\
\notag
\mathbold{K}\,
(\mathbold{1}+
\mathbold{A}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal)
&=
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
\\
\label{eqn:for-k}
\mathbold{K}
&=
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal\,
(\mathbold{1}+
\mathbold{A}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal)^{-1}
\end{align}
#+END_LaTeX

Defining the Kalman denominator matrix $\mathbold{D}$ as follows:

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:definition-of-d}
\mathbold{D}
\stackrel{\text{\tiny def}}{=}
\mathbold{1}+
\mathbold{A}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
\end{equation}
#+END_LaTeX

\noindent we finally get a form for the Kalman gain matrix $\mathbold{K}$
entirely in terms of priors and the new observation partials (sometimes called
the /innovation/):

#+BEGIN_LaTeX
\begin{align}
\label{eqn:kalman-gain-definition-2}
\mathbold{K}
&=
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal\,
\mathbold{D}^{-1} 
\\
\label{eqn:kalman-denominator-definition-2}
\text{where}\quad
\mathbold{D}
&= \mathbold{1} +
\mathbold{A}\,
\mathbold{P}\,
\mathbold{A}^\intercal
\end{align}
#+END_LaTeX

\noindent These are almost the same as the original definitions, equations
\ref{eqn:kalman-gain-definition} and \ref{eqn:kalman-denominator-definition},
which were written in dimensional form. We leave it to the reader to show that
the dimensional form for $\mathbold{D}$ is
$\mathbold{Z}+
\mathbold{A}\,
\mathbold{P}\,
\mathbold{A}^\intercal$.

*** Two More Recurrences

There remain
two more recurrences to derive, namely

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:p-is-lplt-plus-kzkt}
\mathbold{P}\leftarrow
\mathbold{L}\,
\mathbold{P}\,
\mathbold{L}^\intercal +
\mathbold{K}\,
\mathbold{Z}\,
\mathbold{K}^\intercal
\end{equation}
#+END_LaTeX

\noindent and the canonical form,

#+BEGIN_LaTeX
\begin{equation}
\label{eqn:p-is-p-minus-kdkt}
\mathbold{P}\leftarrow
\mathbold{P} -
\mathbold{K}\,
\mathbold{D}\,
\mathbold{K}^\intercal
\end{equation}
#+END_LaTeX

