kalman-folding-03-008-derivations.tex

\subsubsection{Posterior estimate, \(\hat{\mathbold{x}}\)}
\label{sec:orgheadline12}

We must wrangle 
equation
\ref{eqn:kalman-update-equation}
from
equation
\ref{eqn:def-of-posterior-estimate}.
Equation 
\ref{eqn:kalman-update-equation}
is the recurrence we want,
namely 
\(\hat{\mathbold{x}}=\tilde{\mathbold{x}}+\mathbold{K}(\mathbold{z}-\mathbold{A}\,\tilde{\mathbold{x}})\),
and equation
\ref{eqn:def-of-posterior-estimate}
is the recurrence we have, namely\\
\(\hat{\mathbold{x}}
=
\left(
{\tilde{\mathbold{A}}}^2 + 
\mathbold{A}^2
\right)^{-1}\,
\left(
\mathbold{A}^\intercal\,
\mathbold{z} + 
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{x}}}
\right)\).

First, formally define the new, posterior covariance.

\begin{equation}
\label{eqn:new-p-hat-definition}
{\hat{\mathbold{P}}}
\stackrel{\text{\tiny def}}{=}
\left(
{\tilde{\mathbold{A}}}^2 + \mathbold{A}^2
\right)^{-1}
\end{equation}

\noindent Now write 
equation
\ref{eqn:def-of-posterior-estimate}
as

\begin{align*}
\hat{\mathbold{x}}
&=
\hat{\mathbold{P}}\,
\left(
\mathbold{A}^\intercal\,
\mathbold{z} + 
{\tilde{\mathbold{A}}}^2\,
{\tilde{\mathbold{x}}}
\right)
\\
\\
&=
\hat{\mathbold{P}}\,\mathbold{A}^\intercal\,
\mathbold{z}
+
\hat{\mathbold{P}}\,
\tilde{\mathbold{A}}^2\,\tilde{\mathbold{x}}
\\
\end{align*}


The form above strongly suggests that we define

\begin{equation}
\label{eqn:kalman-gain-new-definition}
\mathbold{K}
\stackrel{\text{\tiny def}}{=}
{\hat{\mathbold{P}}}\,
\mathbold{A}^\intercal
\end{equation}

\noindent yielding

\begin{align}
\label{eqn:first-part-of-gain-proof}
\hat{\mathbold{x}}
&=
\mathbold{K}\,
\mathbold{z}
+
{\hat{\mathbold{P}}}\,
\tilde{\mathbold{A}}^2\,\tilde{\mathbold{x}}
\end{align}

\noindent Now, to get the recurrence we want

\begin{align}
\notag
\hat{\mathbold{x}}
&=
\tilde{\mathbold{x}}+
\mathbold{K}
\left(
\mathbold{z}-
\mathbold{A}\,
{\tilde{\mathbold{x}}}
\right)
\\
\label{eqn:second-part-of-gain-proof}
&=
\tilde{\mathbold{x}}+
\mathbold{K}\,
\mathbold{z}-
\mathbold{K}\,
\mathbold{A}\,
{\tilde{\mathbold{x}}}
\end{align}

\noindent we need only set equation \ref{eqn:first-part-of-gain-proof} equal to
equation \ref{eqn:second-part-of-gain-proof}.  Cancelling terms and rearranging,
we get

\begin{align}
\label{eqn:recurrence-to-prove}
(\mathbold{1}-\mathbold{K}\,\mathbold{A})\,
\tilde{\mathbold{x}}
&=
{\hat{\mathbold{P}}}\,
\tilde{\mathbold{A}}^2\,\tilde{\mathbold{x}} 
=
{\hat{\mathbold{P}}}\,
\tilde{\mathbold{P}}^{-1}\,\tilde{\mathbold{x}} 
\end{align}

\noindent by definition of the prior covariance, equation
\ref{eqn:prior-covariance-most-convenient-form}. For arbitrary
\(\tilde{\mathbold{x}}\), this will be true if 

\begin{align*}
(\mathbold{1}-\mathbold{K}\,\mathbold{A})
&=
{\hat{\mathbold{P}}}\,
\tilde{\mathbold{P}}^{-1}
\end{align*}

\noindent Rearrange and right-multiply by \(\tilde{\mathbold{P}}\) to get

\begin{align}
\label{eqn:p-is-l-p}
\hat{\mathbold{P}}
&=\left(
\mathbold{1}-
\mathbold{K}\,
\mathbold{A}
\right)\,
\tilde{\mathbold{P}}
=
\hat{\mathbold{P}}\,{\tilde{\mathbold{A}}}^2\,\tilde{\mathbold{P}}
\end{align}

\noindent showing that equations \ref{eqn:recurrence-to-prove} and
\ref{eqn:kalman-update-equation} are just alternative expressions for the same
thing.


Let's write this more compactly

\begin{align}
\label{eqn:derivation-of-p-is-l-p}
{\hat{\mathbold{P}}} &=
\mathbold{L}\,
{\tilde{\mathbold{P}}}
\end{align}

\noindent where

\begin{equation}
\label{eqn:definition-of-l}
\mathbold{L}\stackrel{\text{\tiny def}}{=}
(\mathbold{1}-
\mathbold{K}\,
\mathbold{A})
=
\hat{\mathbold{P}}\,{\tilde{\mathbold{A}}}^2
\end{equation}

\noindent and we have
one of the three equivalent recurrences
for the posterior covariance
from the first paper in this series

\begin{equation}
{{\mathbold{P}}} \leftarrow
\mathbold{L}\,
{{\mathbold{P}}}
\end{equation}

\subsubsection{A Gain Matrix \(\mathbold{K}\) We Can Actually Compute}
\label{sec:orgheadline13}



Of course, the gain matrix \(\mathbold{K}\) is formally defined in terms of the
posterior covariance, that is, as \(\hat{\mathbold{P}}\,\mathbold{A}^\intercal\),
but we don't have the posterior covariance \(\hat{\mathbold{P}}\) by equation
\ref{eqn:p-is-l-p} until we have the gain matrix \(\mathbold{K}\). To get out of
this fix, we note that 

\begin{equation*}
\mathbold{K}
=
\hat{\mathbold{P}}\,
\mathbold{A}^\intercal
=
\mathbold{L}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
=
(\mathbold{1}-
\mathbold{K}\,
\mathbold{A})\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
\end{equation*}

\noindent and solve for \(\mathbold{K}\):

\begin{align}
\notag
\mathbold{K}
&=
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
-
\mathbold{K}\,
\mathbold{A}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
\\
\notag
\mathbold{K}\,
(\mathbold{1}+
\mathbold{A}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal)
&=
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
\\
\label{eqn:for-k}
\mathbold{K}
&=
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal\,
(\mathbold{1}+
\mathbold{A}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal)^{-1}
\end{align}

Defining the Kalman denominator matrix \(\mathbold{D}\) as follows:

\begin{equation}
\label{eqn:definition-of-d}
\mathbold{D}
\stackrel{\text{\tiny def}}{=}
\mathbold{1}+
\mathbold{A}\,
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal
\end{equation}

\noindent we finally get a form for the Kalman gain matrix \(\mathbold{K}\)
entirely in terms of priors and the new observation partials (sometimes called
the \emph{innovation}):

\begin{align}
\label{eqn:kalman-gain-definition-2}
\mathbold{K}
&=
\tilde{\mathbold{P}}\,
\mathbold{A}^\intercal\,
\mathbold{D}^{-1} 
\\
\label{eqn:kalman-denominator-definition-2}
\text{where }
\mathbold{D}
&= \mathbold{1} +
\mathbold{A}\,
\mathbold{P}\,
\mathbold{A}^\intercal
\end{align}

\noindent These are almost the same as the original definitions, equations
\ref{eqn:kalman-gain-definition} and \ref{eqn:kalman-denominator-definition},
which were written in dimensional form. We leave it to the reader to show that
the dimensional form for \(\mathbold{D}\) is
\(\mathbold{Z}+
\mathbold{A}\,
\mathbold{P}\,
\mathbold{A}^\intercal\).

\subsubsection{Two More Recurrences}
\label{sec:orgheadline14}

There remain
two more recurrences to derive, namely

\begin{equation}
\label{eqn:p-is-lplt-plus-kzkt}
\mathbold{P}\leftarrow
\mathbold{L}\,
\mathbold{P}\,
\mathbold{L}^\intercal +
\mathbold{K}\,
\mathbold{Z}\,
\mathbold{K}^\intercal
\end{equation}

\noindent and the canonical form,

\begin{equation}
\label{eqn:p-is-p-minus-kdkt}
\mathbold{P}\leftarrow
\mathbold{P} -
\mathbold{K}\,
\mathbold{D}\,
\mathbold{K}^\intercal
\end{equation}
