kalman-folding-03-008-derivations.tex

\subsubsection{Minimizing \(J_1({\mathbold{x}})\)}
\label{sec:orgheadline15}

The posterior covariance is, from the statistical viewpoint,

\begin{equation*}
{\hat{\mathbold{P}}} =
E
\left[
({\hat{\mathbold{x}}}-\mathbold{x})
({\hat{\mathbold{x}}}-\mathbold{x})^\intercal
\right]
\end{equation*}

\noindent Get our new expression for \({\hat{\mathbold{x}}}\):

\begin{equation*}
{\hat{\mathbold{x}}} =
{\tilde{\mathbold{x}}}+
\mathbold{K}\,
(\mathbold{z}-
\mathbold{A}\,
{\tilde{\mathbold{x}}}) =
\mathbold{K}\,
\mathbold{z} +
\mathbold{L}\,
{\tilde{\mathbold{x}}}
\end{equation*}

\noindent where, again

\begin{equation*}
\mathbold{L}
=
(\mathbold{1}-
\mathbold{K}\,
\mathbold{A})
=
{\hat{\mathbold{P}}}\,
{\tilde{\mathbold{A}}}^2
\end{equation*}

\noindent
Remembering the observation equation
(\ref{eqn:observation-equation}), write a single instance of it
\(\mathbold{z} =
\mathbold{A}\,
\mathbold{x}+
\mathbold{\zeta}\) and find

\begin{align}
\notag
{\hat{\mathbold{x}}}
&=
\mathbold{K}\,
\mathbold{A}\,
\mathbold{x} +
\mathbold{K}\,
\mathbold{\zeta} +
\mathbold{L}\,
{\tilde{\mathbold{x}}}
\\
\notag
&=
\left(
\mathbold{1}-
\mathbold{L}
\right)\,
\mathbold{x} +
\mathbold{K}\,
\mathbold{\zeta} +
\mathbold{L}\,
{\tilde{\mathbold{x}}}
\end{align}

\noindent implying that
\(\left(
{\hat{\mathbold{x}}}-
\mathbold{x}
\right)=
\mathbold{L}\,
\left(
{\tilde{\mathbold{x}}}-
\mathbold{x}
\right) +
\mathbold{K}\,
\mathbold{\zeta}\).

Remembering that
\(E
\left[
\mathbold{\zeta}
\right]=\mathbold{0}\), 
\(E
\left[
\mathbold{\zeta}\,
\mathbold{\zeta}^\intercal
\right]=\mathbold{Z}\), glibly re-dimensionalizing and skipping
intermediate steps, we find that 

\begin{equation}
{\hat{\mathbold{P}}} = 
\mathbold{L}\,
{\tilde{\mathbold{P}}}\,
\mathbold{L}^\intercal + 
\mathbold{K}\,
\mathbold{Z}\,
\mathbold{K}^\intercal
\end{equation}

\noindent We leave it to the reader to check, with reference to equations
\ref{eqn:dimensional-breakdown}, that the physical dimensions work out. This
completes the derivation of the recurrence equation \ref{eqn:p-is-lplt-plus-kzkt}. 

The last form,
\(\hat{\mathbold{P}}
=
\tilde{\mathbold{P}}-
\mathbold{K}\,
\mathbold{D}\,
\mathbold{K}^\intercal\),
is easy to show from what we already know, that 
\(\hat{\mathbold{P}}
=
\mathbold{L}\,
\tilde{\mathbold{P}}
=
(\mathbold{1}-
\mathbold{K}\,
\mathbold{A})\,
\tilde{\mathbold{P}}\).
We just need to show that 
\(\mathbold{K}\,
\mathbold{A}\,
\tilde{\mathbold{P}} 
=
\mathbold{K}\,
\mathbold{D}\,
\mathbold{K}^\intercal\). 
Substitute 
\(\mathbold{D}^{-\intercal}\,
\mathbold{A}\,
\tilde{\mathbold{P}}^\intercal\)
for \(\mathbold{K}^\intercal\) by transposing
equation \ref{eqn:kalman-gain-definition-2}.
Note that for square matrices, the inverse of the
transpose is the transpose of the inverse. Therefore
\(\mathbold{D}^{-\intercal}
= \mathbold{D}^{-1}\) because \(\mathbold{D}\) is symmetric. Likewise 
\(\tilde{\mathbold{P}}^\intercal=\tilde{\mathbold{P}}\).  The result follows:

\begin{equation*}
\mathbold{K}\,
\mathbold{D}\,
\mathbold{K}^\intercal
=
\mathbold{K}\,
\mathbold{D}\,
\mathbold{D}^{-\intercal}\,
\mathbold{A}
\tilde{\mathbold{P}}
=
\mathbold{K}\,
\mathbold{A}
\tilde{\mathbold{P}}
\end{equation*}



\section{Concluding Remarks}
\label{sec:orgheadline18}

These derivations are helpful for gaining intuition into the underlying
statistics and dimensional structures of the Kalman filter and its many
variants. They are a bit involved, but it is worthwhile to ingest these
fundamentals, especially for those who need to research new filters and
applications. For more rigorous proofs built on a Bayesian perspective, see
Bar-Shalom.\footnotemark[2]{} For more careful dimensional analysis of the present
derivations, see part 6 of this series.\footnote{B. Beckman, \emph{Kalman Folding 6: Dimensional Analysis}, to appear.}
\end{document}